---
kind: property
id: P:Autodesk.Revit.DB.Dimension.Prefix
zh: 尺寸标注、标注
source: html/36e450c8-09af-54af-a25d-9fede511522f.htm
---
# Autodesk.Revit.DB.Dimension.Prefix Property

**中文**: 尺寸标注、标注

The text shown before the segment's value.

## Syntax (C#)
```csharp
public string Prefix { get; set; }
```

## Remarks
This property is for use with single-segmment dimensions only.
For multi-segment dimensions use the corresponding properties of the
DimensionSegment class.